/**
 * アプリ内カラー定義
 */
export const AppColors = {
  /** 黒 */
  black: '#000000',

  /** 白 */
  white: '#FFFFFF',

  /** グレー50 */
  gray50: '#F2F2F2',
  /** グレー100 */
  gray100: '#E6E6E6',
  /** グレー200 */
  gray200: '#CCCCCC',
  /** グレー300 */
  gray300: '#B3B3B3',
  /** グレー400 */
  gray400: '#999999',
  /** グレー420 */
  gray420: '#949494',
  /** グレー500 */
  gray500: '#7F7F7F',
  /** グレー536 */
  gray536: '#767676',
  /** グレー600 */
  gray600: '#666666',
  /** グレー700 */
  gray700: '#4D4D4D',
  /** グレー800 */
  gray800: '#333333',
  /** グレー900 */
  gray900: '#1A1A1A',

  /** 青50 */
  blue50: '#E8F1FE',
  /** 青100 */
  blue100: '#D9E6FF',
  /** 青200 */
  blue200: '#C5D7FB',
  /** 青300 */
  blue300: '#9DB7F9',
  /** 青400 */
  blue400: '#7096F8',
  /** 青500 */
  blue500: '#4979F5',
  /** 青100 */
  blue600: '#3460FB',
  /** 青700 */
  blue700: '#264AF4',
  /** 青800 */
  blue800: '#0031D8',
  /** 青900 */
  blue900: '#0017C1',
  /** 青1000 */
  blue1000: '#00118F',
  /** 青1100 */
  blue1100: '#000071',
  /** 青1200 */
  blue1200: '#000060',

  /** ライトブルー50 */
  lightBlue50: '#F0F9FF',
  /** ライトブルー100 */
  lightBlue100: '#DCF0FF',
  /** ライトブルー200 */
  lightBlue200: '#C0E4FF',
  /** ライトブルー300 */
  lightBlue300: '#97D3FF',
  /** ライトブルー400 */
  lightBlue400: '#57B8FF',
  /** ライトブルー500 */
  lightBlue500: '#39ABFF',
  /** ライトブルー600 */
  lightBlue600: '#008BF2',
  /** ライトブルー700 */
  lightBlue700: '#0877D7',
  /** ライトブルー800 */
  lightBlue800: '#0066BE',
  /** ライトブルー900 */
  lightBlue900: '#0055AD',
  /** ライトブルー1000 */
  lightBlue1000: '#00428C',
  /** ライトブルー1100 */
  lightBlue1100: '#00316A',
  /** ライトブルー1200 */
  lightBlue1200: '#00234B',

  /** 赤200 */
  red200: '#CB8F76',
  /** 赤600 */
  red600: '#FE3939',

  /** 緑300 */
  green300: '#7fffbf',
  /** 緑400 */
  green400: '#97c278',

  /** 黄色200 */
  yellow200: '#C8C99B',
  /** 黄色300 */
  yellow300: '#FDD700',

  /** ピンク100 */
  pink100: '#DA70D6',
};
